# ForwardIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VoltageTypeSet..::..ForwardIterator Method
VoltageTypeSet Class See Also
---
Retrieve a forward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual VoltageTypeSetIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As VoltageTypeSetIterator
```

Visual C++
---
```text
public:
virtual VoltageTypeSetIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the set.
# See Also
VoltageTypeSet Class
Autodesk.Revit.DB.Electrical Namespace